Library cleanup; storage improvements
